haryoiro/suzuha/firmware/sdkconfig.defaults.esp32
# Target: ESP32 (ESP32-CAM)
CONFIG_IDF_TARGET="esp32"

# PSRAM (ESP32-CAM has 4MB PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=1
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7

# Camera
CONFIG_CAMERA_MODULE_ESP32_CAM=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Partition table (3MB app partition)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Suzuha Physical Agent
CONFIG_WIFI_SSID="prushka"
CONFIG_WIFI_PASSWORD="Puruto63846666!"
CONFIG_SERVER_URI="ws://192.168.10.10:9090/ws/device"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
